{
    "easy_CoT": "Context:\nDoll does not have quirky behavior. If Doll looks delicate or has quirky behavior, then she can bring joy. If Dennis looks delicate or has quirky behavior, then she can bring joy. If Doll has a fractious personality, then she either causes trouble or brings joy, but not both. Doll looks delicate. Doll has a fractious personality. Kian looks delicate.\n\nQuestion: Based on the above information, is the following statement true, false, or uncertain? Doll does not cause trouble.\n\nOptions:\nA) True\nB) False\nC) Uncertain\n\nThe correct option is: {\n  \"reasoning\": \"Doll looks delicate. Doll does not have quirky behavior. If Doll looks delicate or has quirky behavior, then she can bring joy. Doll brings joy. Doll has a fractious personality. Doll brings joy. If Doll has a fractious personality, then she either causes trouble or brings joy, but not both. Doll does not cause trouble. Therefore, it is true that Doll does not cause trouble. The correct option is: A.\",\n  \"answer\": \"A\"\n}\n------\nContext:\nIf Kristian is charismatic or influential, then he uses his platform for good. Kristian is influential.\n\nQuestion: Based on the above information, is the following statement true, false, or uncertain? Kristian does not use his platform for good.\n\nOptions:\nA) True\nB) False\nC) Uncertain\n\nThe correct option is: {\n  \"reasoning\": \"Kristian is influential. If Kristian is charismatic or influential, then he uses his platform for good. Kristian uses his platform for good. Therefore, it is false that Kristian does not use his platform for good. The correct option is: B.\",\n  \"answer\": \"B\"\n}\n------\nContext:\n[[CONTEXT]]\n\nQuestion: [[QUESTION]]\n\nOptions:\n[[OPTIONS]]\n\nThe correct option is:",
    "easy_Direct": "Context:\nDoll does not have quirky behavior. If Doll looks delicate or has quirky behavior, then she can bring joy. If Dennis looks delicate or has quirky behavior, then she can bring joy. If Doll has a fractious personality, then she either causes trouble or brings joy, but not both. Doll looks delicate. Doll has a fractious personality. Kian looks delicate.\n\nQuestion: Based on the above information, is the following statement true, false, or uncertain? Doll does not cause trouble.\n\nOptions:\nA) True\nB) False\nC) Uncertain\n\nThe correct option is: {\n  \"answer\": \"A\"\n}\n------\nContext:\nIf Kristian is charismatic or influential, then he uses his platform for good. Kristian is influential.\n\nQuestion: Based on the above information, is the following statement true, false, or uncertain? Kristian does not use his platform for good.\n\nOptions:\nA) True\nB) False\nC) Uncertain\n\nThe correct option is: {\n  \"answer\": \"B\"\n}\n------\nContext:\n[[CONTEXT]]\n\nQuestion: [[QUESTION]]\n\nOptions:\n[[OPTIONS]]\n\nThe correct option is:",
    "medium_CoT": "Context:\nAnyone who can solve problems and communicate effectively has practical skills. If Paola appreciates beauty, then she values precision and enjoys manual work. Paola appreciates beauty. Paola is either skilled in mathematics or has practical skills, but not both. If someone enjoys manual work and values attention to detail, then they can craft with their hands. Paola is either skilled in mathematics or artistically inclined, but surprisingly, she is actually both. Paola values attention to detail. Anyone who crafts with their hands has practical skills.\n\nQuestion: Based on the above information, is the following statement true, false, or uncertain? Paola is artistically inclined.\n\nOptions:\nA) True\nB) False\nC) Uncertain\n\nThe correct option is: {\n  \"reasoning\": \"Paola appreciates beauty. If Paola appreciates beauty, then she values precision and enjoys manual work. Paola enjoys manual work. Paola enjoys manual work. Paola values attention to detail. If someone enjoys manual work and values attention to detail, then they can craft with their hands. Paola crafts with her hands. Paola crafts with her hands. Anyone who crafts with their hands has practical skills. Paola has practical skills. Paola has practical skills. Paola is either skilled in mathematics or has practical skills, but not both. Paola is not skilled in mathematics. Paola is not skilled in mathematics. Paola is either skilled in mathematics or artistically inclined, but surprisingly, she is actually both. Paola is artistically inclined. Therefore, it is true that Paola is artistically inclined. The correct option is: A.\",\n  \"answer\": \"A\"\n}\n------\nContext:\nIf Priscilla loves nature or shares beautiful images (or both), then she inspires environmental awareness. Priscilla either portrays cityscapes or captures sunsets, but not both. Priscilla documents wildlife. If Priscilla has an urban focus, then she will portray cityscapes. If Priscilla travels extensively, then she either takes landscape photos or captures sunsets (or both). Priscilla has an urban focus. Everyone who either documents wildlife or captures sunsets (but not both) shares beautiful images.\n\nQuestion: Based on the above information, is the following statement true, false, or uncertain? Priscilla does not inspire environmental awareness.\n\nOptions:\nA) True\nB) False\nC) Uncertain\n\nThe correct option is: {\n  \"reasoning\": \"Priscilla has an urban focus. If Priscilla has an urban focus, then she will portray cityscapes. Priscilla portrays cityscapes. Priscilla portrays cityscapes. Priscilla either portrays cityscapes or captures sunsets, but not both. Priscilla does not capture sunsets. Priscilla documents wildlife. Priscilla does not capture sunsets. Everyone who either documents wildlife or captures sunsets (but not both) shares beautiful images. Priscilla shares beautiful images. Priscilla shares beautiful images. If Priscilla loves nature or shares beautiful images (or both), then she inspires environmental awareness. Priscilla inspires environmental awareness. Therefore, it is false that Priscilla does not inspire environmental awareness. The correct option is: B.\",\n  \"answer\": \"B\"\n}\n------\nContext:\n[[CONTEXT]]\n\nQuestion: [[QUESTION]]\n\nOptions:\n[[OPTIONS]]\n\nThe correct option is:",
    "medium_Direct": "Context:\nAnyone who can solve problems and communicate effectively has practical skills. If Paola appreciates beauty, then she values precision and enjoys manual work. Paola appreciates beauty. Paola is either skilled in mathematics or has practical skills, but not both. If someone enjoys manual work and values attention to detail, then they can craft with their hands. Paola is either skilled in mathematics or artistically inclined, but surprisingly, she is actually both. Paola values attention to detail. Anyone who crafts with their hands has practical skills.\n\nQuestion: Based on the above information, is the following statement true, false, or uncertain? Paola is artistically inclined.\n\nOptions:\nA) True\nB) False\nC) Uncertain\n\nThe correct option is: {\n  \"answer\": \"A\"\n}\n------\nContext:\nIf Priscilla loves nature or shares beautiful images (or both), then she inspires environmental awareness. Priscilla either portrays cityscapes or captures sunsets, but not both. Priscilla documents wildlife. If Priscilla has an urban focus, then she will portray cityscapes. If Priscilla travels extensively, then she either takes landscape photos or captures sunsets (or both). Priscilla has an urban focus. Everyone who either documents wildlife or captures sunsets (but not both) shares beautiful images.\n\nBased on the above information, is the following statement true, false, or uncertain? Priscilla does not inspire environmental awareness.\n\nOptions:\nA) True\nB) False\nC) Uncertain\n\nThe correct option is: {\n  \"answer\": \"B\"\n}\n------\nContext:\n[[CONTEXT]]\n\nQuestion: [[QUESTION]]\n\nOptions:\n[[OPTIONS]]\n\nThe correct option is:",
    "hard_CoT": "Context:\nCleo is curious. If Cleo has a strong work ethic, then she either makes key discoveries or holds a leadership position. If Cleo has a passion for science, then she either conducts groundbreaking research or holds a leadership position. Cleo makes key discoveries. Cleo has a passion for science. If Cleo faces a personal struggle, then she either dedicates herself to her craft or pursues a noble profession (but not both). Cleo pursues a noble profession. For all humans, if someone conducts groundbreaking research, then they improve patient lives and earn recognition. If Cleo is curious, then she has a strong work ethic and values critical thinking. If Cleo is compassionate, then she either pioneers new treatments or dedicates herself to her craft (but not both). Cleo faces a personal struggle.\n\nQuestion: Based on the above information, is the following statement true, false, or uncertain? Cleo earns recognition.\n\nOptions:\nA) True\nB) False\nC) Uncertain\n\nThe correct option is: {\n  \"reasoning\": \"Cleo is curious. If Cleo is curious, then she has a strong work ethic and values critical thinking. Cleo has a strong work ethic. Cleo has a strong work ethic. Cleo makes key discoveries. If Cleo has a strong work ethic, then she either makes key discoveries or holds a leadership position. Cleo does not hold a leadership position. Cleo has a passion for science. Cleo does not hold a leadership position. If Cleo has a passion for science, then she either conducts groundbreaking research or holds a leadership position. Cleo conducts groundbreaking research. Cleo faces a personal struggle. Cleo pursues a noble profession. If Cleo faces a personal struggle, then she either dedicates herself to her craft or pursues a noble profession (but not both). Cleo does not dedicate herself to her craft. Cleo conducts groundbreaking research. For all humans, if someone conducts groundbreaking research, then they improve patient lives and earn recognition. Cleo earns recognition. Therefore, it is true that Cleo earns recognition. The correct option is: A.\",\n  \"answer\": \"A\"\n}\n------\nContext:\nIf an orchid has roots and photosynthesizes, then it can bloom beautifully. Every orchid that grows in trees either photosynthesizes or uses aerial roots. Kinsley does not cling to a host. Kinsley does not require high humidity. Kinsley is ground-dwelling. All orchids that get nourishment and support their own weight develop roots. If Kinsley is either terrestrial or epiphytic (but not both), then she is thriving. If Kinsley has vibrant colors, then she either attracts pollinators or grows rapidly, but not both. Every orchid has roots or clings to a host. Kinsley needs indirect light. Every orchid that either blooms beautifully or releases fragrance is able to attract pollinators. If Kinsley either requires high humidity or needs indirect light (but not both), then she has vibrant colors. Colson grows rapidly. Kinsley does not release fragrance. If Kinsley is adaptable, then she is either ground-dwelling or epiphytic, but not both. If Kinsley derives nutrients, then she either is terrestrial or photosynthesizes. Ezra is adaptable. Any orchid that gets enough sunlight or retains moisture can bloom beautifully. Kinsley derives nutrients. Colson does not release fragrance. If Ezra either requires high humidity or needs indirect light (but not both), then she has vibrant colors. Kinsley grows rapidly. Kinsley is adaptable.\n\nQuestion: Based on the above information, is the following statement true, false, or uncertain? Kinsley is not thriving.\n\nOptions:\nA) True\nB) False\nC) Uncertain\n\nThe correct option is: {\n  \"reasoning\": \"Kinsley does not cling to a host. Every orchid has roots or clings to a host. Kinsley has roots. Kinsley does not require high humidity. Kinsley needs indirect light. If Kinsley either requires high humidity or needs indirect light (but not both), then she has vibrant colors. Kinsley has vibrant colors. Kinsley has vibrant colors. Kinsley grows rapidly. If Kinsley has vibrant colors, then she either attracts pollinators or grows rapidly, but not both. Kinsley is not able to attract pollinators. Kinsley does not release fragrance. Kinsley is not able to attract pollinators. Every orchid that either blooms beautifully or releases fragrance is able to attract pollinators. Kinsley cannot bloom beautifully. Kinsley has roots. Kinsley cannot bloom beautifully. If an orchid has roots and photosynthesizes, then it can bloom beautifully. Kinsley does not photosynthesize. Kinsley is adaptable. Kinsley is ground-dwelling. If Kinsley is adaptable, then she is either ground-dwelling or epiphytic, but not both. Kinsley is not epiphytic. Kinsley derives nutrients. Kinsley does not photosynthesize. If Kinsley derives nutrients, then she either is terrestrial or photosynthesizes. Kinsley is terrestrial. Kinsley is terrestrial. Kinsley is not epiphytic. If Kinsley is either terrestrial or epiphytic (but not both), then she is thriving. Kinsley is not thriving. Therefore, it is false that Kinsley is not thriving. The correct option is: B.\",\n  \"answer\": \"B\"\n}\n------\nContext:\n[[CONTEXT]]\n\nQuestion: [[QUESTION]]\n\nOptions:\n[[OPTIONS]]\n\nThe correct option is:",
    "hard_Direct": "Context:\nCleo is curious. If Cleo has a strong work ethic, then she either makes key discoveries or holds a leadership position. If Cleo has a passion for science, then she either conducts groundbreaking research or holds a leadership position. Cleo makes key discoveries. Cleo has a passion for science. If Cleo faces a personal struggle, then she either dedicates herself to her craft or pursues a noble profession (but not both). Cleo pursues a noble profession. For all humans, if someone conducts groundbreaking research, then they improve patient lives and earn recognition. If Cleo is curious, then she has a strong work ethic and values critical thinking. If Cleo is compassionate, then she either pioneers new treatments or dedicates herself to her craft (but not both). Cleo faces a personal struggle.\n\nQuestion: Based on the above information, is the following statement true, false, or uncertain? Cleo earns recognition.\n\nOptions:\nA) True\nB) False\nC) Uncertain\n\nThe correct option is: {\n  \"answer\": \"A\"\n}\n------\nContext:\nIf an orchid has roots and photosynthesizes, then it can bloom beautifully. Every orchid that grows in trees either photosynthesizes or uses aerial roots. Kinsley does not cling to a host. Kinsley does not require high humidity. Kinsley is ground-dwelling. All orchids that get nourishment and support their own weight develop roots. If Kinsley is either terrestrial or epiphytic (but not both), then she is thriving. If Kinsley has vibrant colors, then she either attracts pollinators or grows rapidly, but not both. Every orchid has roots or clings to a host. Kinsley needs indirect light. Every orchid that either blooms beautifully or releases fragrance is able to attract pollinators. If Kinsley either requires high humidity or needs indirect light (but not both), then she has vibrant colors. Colson grows rapidly. Kinsley does not release fragrance. If Kinsley is adaptable, then she is either ground-dwelling or epiphytic, but not both. If Kinsley derives nutrients, then she either is terrestrial or photosynthesizes. Ezra is adaptable. Any orchid that gets enough sunlight or retains moisture can bloom beautifully. Kinsley derives nutrients. Colson does not release fragrance. If Ezra either requires high humidity or needs indirect light (but not both), then she has vibrant colors. Kinsley grows rapidly. Kinsley is adaptable.\n\nQuestion: Based on the above information, is the following statement true, false, or uncertain? Kinsley is not thriving.\n\nOptions:\nA) True\nB) False\nC) Uncertain\n\nThe correct option is: {\n  \"answer\": \"B\"\n}\n------\nContext:\n[[CONTEXT]]\n\nQuestion: [[QUESTION]]\n\nOptions:\n[[OPTIONS]]\n\nThe correct option is:"
}